In [9]:
import pandas as pd

ind_weather = pd.DataFrame({'city':['mumbai','delhi','bangalore'],
                           'temp':[32,45,30],
                           'humidity':[80,60,78]
                           })
us_weather = pd.DataFrame({'city':['new york','chicago','orlando'],
                          'temp':[21,14,35],
                          'humidity':[68,65,75]})
type(ind_weather)
#type(us_weather)

pandas.core.frame.DataFrame

In [10]:
df = pd.concat([ind_weather,us_weather])
df

        city  temp  humidity
0     mumbai    32        80
1      delhi    45        60
2  bangalore    30        78
0   new york    21        68
1    chicago    14        65
2    orlando    35        75

In [11]:
df = pd.concat([ind_weather,us_weather],ignore_index=True)
df

        city  temp  humidity
0     mumbai    32        80
1      delhi    45        60
2  bangalore    30        78
3   new york    21        68
4    chicago    14        65
5    orlando    35        75

In [16]:
df = pd.concat([ind_weather,us_weather],keys=["ind","us"])
df

            city  temp  humidity
ind 0     mumbai    32        80
    1      delhi    45        60
    2  bangalore    30        78
us  0   new york    21        68
    1    chicago    14        65
    2    orlando    35        75

In [19]:
df.loc["ind"]

        city  temp  humidity
0     mumbai    32        80
1      delhi    45        60
2  bangalore    30        78

In [27]:
temp_df = pd.DataFrame({'city':['mumbai','delhi','bangalore'],
                               'temp':[32,45,30]},index=[0,1,2])
temp_df

        city  temp
0     mumbai    32
1      delhi    45
2  bangalore    30

In [28]:
wind_df =  pd.DataFrame({'city':['delhi','mumbai'],
                           'humidity':[80,60]},index=[1,0]
                           )
wind_df

     city  humidity
1   delhi        80
0  mumbai        60

In [29]:
df = pd.concat([temp_df,wind_df],axis=1)
df

        city  temp    city  humidity
0     mumbai    32  mumbai      60.0
1      delhi    45   delhi      80.0
2  bangalore    30     NaN       NaN

In [32]:
s = pd.Series(['Humid','Dry','Rainy'],name='Event')
s

0    Humid
1      Dry
2    Rainy
Name: Event, dtype: object

In [33]:
df = pd.concat([temp_df,s],axis=1)
df

        city  temp  Event
0     mumbai    32  Humid
1      delhi    45    Dry
2  bangalore    30  Rainy